
&НаКлиенте
Процедура Рассчитать(Команда)
	// Исходный код расчетного модуля является интеллектуальной собственностью и предоставляется по запросу.
КонецПроцедуры

&НаСервере
Процедура РассчитатьНаСервере()
	// Исходный код расчетного модуля является интеллектуальной собственностью и предоставляется по запросу.
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокБлюдДляАнализа()
	// Исходный код расчетного модуля является интеллектуальной собственностью и предоставляется по запросу.
КонецФункции

&НаСервере
Функция ПолучитьПродажиПоДню(ПериодАнализа, Магазин, Склад, НомерДня)
	// Исходный код расчетного модуля является интеллектуальной собственностью и предоставляется по запросу.
КонецФункции

&НаСервере
Функция РассчитатьСредневзвешенноеПоМассиву(МассивПродаж)
	// Исходный код расчетного модуля является интеллектуальной собственностью и предоставляется по запросу.
КонецФункции

&НаСервере
Функция ПолучитьКоэфИзРегистра(ДатаПрогноза, ВыбМагазин)
	// Исходный код расчетного модуля является интеллектуальной собственностью и предоставляется по запросу.
КонецФункции

&НаСервере
Процедура ОбновитьДиаграмму()
	// Исходный код расчетного модуля является интеллектуальной собственностью и предоставляется по запросу.
КонецПроцедуры

&НаКлиенте
Процедура СформироватьРекомендации(Команда)
	// Исходный код расчетного модуля является интеллектуальной собственностью и предоставляется по запросу.
КонецПроцедуры  

&НаСервере
Процедура СформироватьРекомендацииНаСервере()
	// Исходный код расчетного модуля является интеллектуальной собственностью и предоставляется по запросу.
КонецПроцедуры    

&НаКлиенте
Процедура Печать(Команда)
	// Исходный код расчетного модуля является интеллектуальной собственностью и предоставляется по запросу.
КонецПроцедуры

&НаСервере
Функция СформироватьПечатнуюФормуНаСервере()
	// Исходный код расчетного модуля является интеллектуальной собственностью и предоставляется по запросу.
КонецФункции






